Revit 2027 API
Definition.GetGroupTypeId Method
 Returns the identifier of the parameter definition's parameter group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract ForgeTypeId GetGroupTypeId()
Public MustOverride Function GetGroupTypeId As ForgeTypeId
public:
virtual ForgeTypeId^ GetGroupTypeId() abstract
abstract GetGroupTypeId : unit -> ForgeTypeId
Return Value
ForgeTypeId
See Also
Reference
Definition Class
Autodesk.Revit.DB Namespace